In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

In [6]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [7]:
inputs = pd.concat([inputs, dummies], axis = 'columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [8]:
inputs.drop('Sex', axis = 'columns', inplace = True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [9]:
inputs.columns[inputs.isna().any()] # Is there any N/A values

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10] #Printing the first 10 values

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
# To overcome this problem take mean of the Age column and fill all the terms in it with mean of the age

In [12]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [13]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [14]:
len(X_train)

712

In [15]:
len(X_test)

179

In [16]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [17]:
model.fit(X_train, y_train)

GaussianNB()

In [18]:
model.score(X_test, y_test)

0.776536312849162

In [19]:
X_test[0:10]

     Pclass   Age      Fare  female  male
23        1  28.0   35.5000       0     1
294       3  24.0    7.8958       0     1
332       1  38.0  153.4625       0     1
86        3  16.0   34.3750       0     1
11        1  58.0   26.5500       1     0
336       1  29.0   66.6000       0     1
171       3   4.0   29.1250       0     1
769       3  32.0    8.3625       0     1
105       3  28.0    7.8958       0     1
72        2  21.0   73.5000       0     1

In [20]:
y_test[0:10]

23     1
294    0
332    0
86     0
11     1
336    0
171    0
769    0
105    0
72     0
Name: Survived, dtype: int64

In [21]:
model.predict(X_test[0:10])

array([0, 0, 1, 0, 1, 0, 0, 0, 0, 0], dtype=int64)

In [22]:
model.predict_proba(X_test[0:10])

array([[0.91086751, 0.08913249],
       [0.98727407, 0.01272593],
       [0.0055607 , 0.9944393 ],
       [0.9817703 , 0.0182297 ],
       [0.00967928, 0.99032072],
       [0.80408051, 0.19591949],
       [0.97405812, 0.02594188],
       [0.98898598, 0.01101402],
       [0.98824322, 0.01175678],
       [0.8953783 , 0.1046217 ]])